waterloop/MC_STM32/STM32_F405_MC/STM32_F405_MC.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
ProjectManager.MainLocation=Core/Src
RCC.CortexFreq_Value=168000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F405RGTx
SH.ADCx_IN2.0=ADC1_IN2,IN2
RCC.PLLCLKFreq_Value=168000000
RCC.PLLQCLKFreq_Value=84000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_TIM8_Init-TIM8-false-HAL-true,4-MX_TIM12_Init-TIM12-false-HAL-true
PC0.GPIOParameters=GPIO_Label
PC0.GPIO_Label=ADC_VA
PC3.Locked=true
RCC.RTCFreq_Value=32000
PC1.Locked=true
PB15.Signal=TIM8_CH3N
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
VP_TIM8_VS_ClockSourceITR.Signal=TIM8_VS_ClockSourceITR
Mcu.IP4=TIM8
RCC.FCLKCortexFreq_Value=168000000
Mcu.IP5=TIM12
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=RCC
Mcu.IP3=SYS
Mcu.IP0=ADC1
Mcu.IP1=NVIC
Mcu.UserConstants=
PC1.GPIOParameters=GPIO_Label
Mcu.ThirdPartyNb=0
TIM8.Channel-PWM\ Generation2\ CH2\ CH2N=TIM_CHANNEL_2
RCC.HCLKFreq_Value=168000000
Mcu.IPNb=6
RCC.I2SClocksFreq_Value=192000000
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=168000000
RCC.VcooutputI2S=192000000
PC7.Signal=S_TIM8_CH2
PC3.Signal=ADCx_IN13
Mcu.Pin6=PA4
Mcu.Pin7=PA5
Mcu.Pin8=PA7
Mcu.Pin9=PB14
VP_TIM12_VS_ClockSourceITR.Mode=TriggerSource_ITR0
RCC.AHBFreq_Value=168000000
Mcu.Pin0=PC0
Mcu.Pin1=PC1
TIM8.IPParameters=Channel-PWM Generation1 CH1 CH1N,Channel-PWM Generation2 CH2 CH2N,Channel-PWM Generation3 CH3 CH3N,Prescaler,Period,CounterMode,DeadTime
Mcu.Pin2=PC2
Mcu.Pin3=PC3
PA0-WKUP.GPIOParameters=GPIO_Label
Mcu.Pin4=PA0-WKUP
Mcu.Pin5=PA2
TIM8.Channel-PWM\ Generation1\ CH1\ CH1N=TIM_CHANNEL_1
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_0
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=25000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.Locked=true
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
TIM12.Period=16800-1
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.26.1
MxDb.Version=DB.6.0.21
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=2000000
PB14.Mode=PWM Generation2 CH2 CH2N
File.Version=6
SH.ADCx_IN11.ConfNb=1
SH.ADCx_IN13.ConfNb=1
SH.ADCx_IN0.0=ADC1_IN0,IN0
SH.ADCx_IN4.ConfNb=1
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
SH.S_TIM8_CH1.ConfNb=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
ProjectManager.ProjectName=STM32_F405_MC
SH.S_TIM8_CH3.ConfNb=1
RCC.MCO2PinFreq_Value=168000000
Mcu.Package=LQFP64
TIM8.Channel-PWM\ Generation3\ CH3\ CH3N=TIM_CHANNEL_3
PA5.Locked=true
PA7.Locked=true
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=ISENC
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA5.GPIOParameters=GPIO_Label
TIM8.Prescaler=1-1
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.APB1TimFreq_Value=84000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIO_Label=ISENA
PC2.GPIO_Label=ADC_VDC
ProjectManager.CustomerFirmwarePackage=
PB15.Locked=true
SH.S_TIM8_CH3.0=TIM8_CH3,PWM Generation3 CH3 CH3N
PA2.Locked=true
VP_TIM12_VS_ClockSourceITR.Signal=TIM12_VS_ClockSourceITR
ProjectManager.ProjectFileName=STM32_F405_MC.ioc
SH.ADCx_IN13.0=ADC1_IN13,IN13
ADC1.Rank-0\#ChannelRegularConversion=1
PA7.Mode=PWM Generation1 CH1 CH1N
Mcu.PinsNb=17
ProjectManager.NoMain=false
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag,master
PC8.Signal=S_TIM8_CH3
PC2.Signal=ADCx_IN12
PC6.Signal=S_TIM8_CH1
VP_TIM8_VS_ClockSourceITR.Mode=TriggerSource_ITR0
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
PB14.Locked=true
PC0.Signal=ADCx_IN10
RCC.APB1CLKDivider=RCC_HCLK_DIV4
SH.S_TIM8_CH2.0=TIM8_CH2,PWM Generation2 CH2 CH2N
RCC.FamilyName=M
PA0-WKUP.GPIO_Label=ADC_TEMP
PA0-WKUP.Signal=ADCx_IN0
PA0-WKUP.Locked=true
PC3.GPIOParameters=GPIO_Label
SH.ADCx_IN12.0=ADC1_IN12,IN12
ProjectManager.TargetToolchain=STM32CubeIDE
NVIC.TIM8_BRK_TIM12_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PC2.Locked=true
ProjectManager.RegisterCallBack=
RCC.LSE_VALUE=32768
RCC.VCOI2SOutputFreq_Value=384000000
TIM12.Prescaler=1-1
PB14.Signal=TIM8_CH2N
PA5.Signal=ADCx_IN5
SH.S_TIM8_CH1.0=TIM8_CH1,PWM Generation1 CH1 CH1N
TIM8.DeadTime=100
board=custom
RCC.VCOOutputFreq_Value=336000000
ProjectManager.LastFirmware=true
PB15.Mode=PWM Generation3 CH3 CH3N
RCC.APB2Freq_Value=84000000
SH.ADCx_IN11.0=ADC1_IN11,IN11
MxCube.Version=6.2.1
SH.ADCx_IN0.ConfNb=1
SH.ADCx_IN10.ConfNb=1
PC2.GPIOParameters=GPIO_Label
SH.ADCx_IN2.ConfNb=1
PC1.GPIO_Label=ADC_VB
VP_SYS_VS_Systick.Mode=SysTick
RCC.EthernetFreq_Value=168000000
SH.ADCx_IN12.ConfNb=1
SH.ADCx_IN4.0=ADC1_IN4,IN4
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
ProjectManager.FreePins=false
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VcooutputI2S
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F405RGTx
RCC.RTCHSEDivFreq_Value=12500000
PA2.Signal=ADCx_IN2
ProjectManager.UnderRoot=true
TIM8.Period=16800-1
ProjectManager.CoupleFile=false
RCC.48MHZClocksFreq_Value=84000000
PA4.Signal=ADCx_IN4
RCC.SYSCLKFreq_VALUE=168000000
ADC1.master=1
PA5.GPIO_Label=ISENB
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
SH.ADCx_IN10.0=ADC1_IN10,IN10
ProjectManager.HeapSize=0x200
Mcu.Pin15=VP_TIM8_VS_ClockSourceITR
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=VP_TIM12_VS_ClockSourceITR
Mcu.Pin13=PC8
Mcu.Pin14=VP_SYS_VS_Systick
ProjectManager.ComputerToolchain=false
RCC.HSI_VALUE=16000000
SH.ADCx_IN5.0=ADC1_IN5,IN5
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PC6
Mcu.Pin12=PC7
RCC.PLLM=8
RCC.PLLN=168
Mcu.Pin10=PB15
PC3.GPIO_Label=ADC_VC
SH.ADCx_IN5.ConfNb=1
RCC.APB1Freq_Value=42000000
PC0.Locked=true
TIM12.IPParameters=Prescaler,Period
ProjectManager.DeviceId=STM32F405RGTx
PC1.Signal=ADCx_IN11
SH.S_TIM8_CH2.ConfNb=1
ProjectManager.LibraryCopy=1
TIM8.CounterMode=TIM_COUNTERMODE_CENTERALIGNED3
PA7.Signal=TIM8_CH1N
isbadioc=false
